src/Documents/ИзменениеЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеЦен</Name>
			<Comment>Изменение цен компании и контрагентов</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ВводОстатковТоваров</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.СогласованиеЗакупочныхЦен</xr:Item>
				<xr:Item>Catalog.ПрайсЛистыКонтрагентов</xr:Item>
				<xr:Item>Document.МониторингЦенКонкурентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровКомпании</xr:Item>
				<xr:Item>InformationRegister.Цены</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик товара, для которого регистрируются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, относительно которого производится расчет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеЗакупочныхЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.МониторингЦенКонкурентов</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеФорматовПодразделения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортиментаФорматов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик, от цен которого рассчитываем новые цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании на котором хранятся товары (в случае если расчет цен идет от себестоимости товаров)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрайсЛистКонтрагента</Name>
					<Comment>Прайс-лист контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛистыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпанииПолучатель</Name>
					<Comment>Подразделение компании, для которого назначаются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовоеПодразделение</Name>
					<Comment>Базовое подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ит_ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Товары цены которых надо изменить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>Устанавливаемый тип цен</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Новая цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Comment>Базовая цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Наценка на базовую цену для вычисления устанавливаемой цены</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЕдиницаИзмерения</Name>
							<Comment>Базовая единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаценки</Name>
							<Comment>Сумма наценки на базовую цену</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчета</Name>
					<Comment>Параметры расчета цен</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>Устанавливаемый тип цен</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетЦенОт</Name>
							<Comment>Признак того, относительно чего производится расчет цен</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Процент наценки на базовую цену</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценкиИзНоменклатуры</Name>
							<Comment>Использовать процент наценки, указанный в карточке номенклатуры</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценкиИзРекомендуемых</Name>
							<Comment>Использовать рекомендуемый процент наценки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьДо</Name>
							<Comment>Округлять расчетную цену до... (знаков после запятой)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглениеИзТипаЦены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦенГрупповойУстановки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СогласованныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СогласованныеЦены</Name>
			<Comment>Согласование цен с контрагентами*</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатуры для контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаБезНДС</Name>
					<Comment>Цена номенклатуры для контрагента без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>блЦенаИзготовителя</Name>
					<Comment>Всегда указывается без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОтклонения</Name>
					<Comment>Процент отклонения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвантПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ1</Name>
					<Comment>Минимальное количество к заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ2</Name>
					<Comment>Минимальное количество к заказу (альтернативное)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия цен</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПоставки</Name>
					<Comment>Группа поставки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ИзменениеЦен/Ext/ObjectModule.bsl
// Модуль документа "Изменение цен"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

// Производит заполнение объекта на основании документа "Поступление товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация           = Справочники.ХозОперации.УстановкаЦенКомпании;
	Контрагент            = Справочники.Контрагенты.ПустаяСсылка();
	ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	ТипЦенНоменклатуры = ДанныеЗаполнения.ТипЦен;
	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	БазовыйТипЦен = ДанныеЗаполнения.ТипЦен;
	
	НоваяСтрока = ПараметрыРасчета.Добавить();
	НоваяСтрока.ТипЦен = ТипЦенНоменклатуры;
	
	Если НоваяСтрока.ТипЦен.Рассчитывается Тогда
		НоваяСтрока.ПроцентНаценки = НоваяСтрока.ТипЦен.ПроцентСкидкиНаценки;
	КонецЕсли;
	НоваяСтрока.РасчетЦенОт   = 1;
	НоваяСтрока.ОкруглятьДо = 0.01;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		ТекущаяСтрока.ТипЦен = ТипЦенНоменклатуры;
		ТекущаяСтрока.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(ТекущаяСтрока.Номенклатура);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.СкладКомпании.ТипЦенРозничнойТорговли) И ДанныеЗаполнения.СкладКомпании.ТипЦенРозничнойТорговли <> ТипЦенНоменклатуры Тогда
		ТипЦенНоменклатуры = ДанныеЗаполнения.СкладКомпании.ТипЦенРозничнойТорговли;
		НоваяСтрока = ПараметрыРасчета.Добавить();
		НоваяСтрока.ТипЦен = ТипЦенНоменклатуры;
		
		Если НоваяСтрока.ТипЦен.Рассчитывается Тогда
			НоваяСтрока.ПроцентНаценки = НоваяСтрока.ТипЦен.ПроцентСкидкиНаценки;
		КонецЕсли;
		НоваяСтрока.РасчетЦенОт   = 1;
		НоваяСтрока.ОкруглятьДо = 0.01;
		Для Каждого ТекСтрока Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ТипЦен = ТипЦенНоменклатуры;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.Цена = ТекСтрока.ЦенаРозничная;
			НоваяСтрока.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(НоваяСтрока.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Документы.ИзменениеЦен.ЗаполнитьБазовыеЦены(ЭтотОбъект);
	
	//ДатаНачалаДействия = ДанныеЗаполнения.Дата;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПоступлениеТоваров()

// Производит заполнение объекта на основании документа "Ввод остатков товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ВводОстатковТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Возвращаем заполнение по поступлению
	Возврат ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецФункции // ОбработкаЗаполнения_ВводОстатковТоваров()

// Производит заполнение объекта на основании документа "Авансовый отчет"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_АвансовыйОтчет(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Возвращаем заполнение по поступлению
	Возврат ОбработкаЗаполнения_ПоступлениеТоваров(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
КонецФункции // ОбработкаЗаполнения_АвансовыйОтчет()

// Производит заполнение объекта на основании документа "Перемещение товаров"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПеремещениеТоваров(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ХозОперация           = Справочники.ХозОперации.УстановкаЦенКомпании;
	Контрагент            = Справочники.Контрагенты.ПустаяСсылка();
	ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Если ТипЗнч(ДанныеЗаполнения.СкладПолучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		ПодразделениеКомпанииПолучатель = ДанныеЗаполнения.СкладПолучатель.ПодразделениеКомпании;
	Иначе
		ПодразделениеКомпанииПолучатель = ДанныеЗаполнения.СкладПолучатель;
	КонецЕсли;
	
	НоваяСтрока = ПараметрыРасчета.Добавить();
	НоваяСтрока.ТипЦен = ДанныеЗаполнения.ТипЦен;
	
	Если НоваяСтрока.ТипЦен.Рассчитывается Тогда
		НоваяСтрока.ПроцентНаценки = НоваяСтрока.ТипЦен.ПроцентСкидкиНаценки;
	КонецЕсли;
	НоваяСтрока.РасчетЦенОт = 6;
	НоваяСтрока.ОкруглятьДо = 0.01;
	
	Если ТипЗнч(ДанныеЗаполнения.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		БазовоеПодразделение = ДанныеЗаполнения.СкладКомпании.ПодразделениеКомпании;
	Иначе
		БазовоеПодразделение = ДанныеЗаполнения.СкладКомпании;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		ТекущаяСтрока.ТипЦен = НоваяСтрока.ТипЦен;
	КонецЦикла;
	
	Документы.ИзменениеЦен.ЗаполнитьБазовыеЦены(ЭтотОбъект);
	//ДатаНачалаДействия = ДанныеЗаполнения.Дата;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ЦенаБазовая) Тогда
			СтрокаТЧ.Цена = СтрокаТЧ.ЦенаБазовая + СтрокаТЧ.ЦенаБазовая*СтрокаТЧ.ПроцентНаценки/100;
		Иначе
			СтрокаТЧ.ЦенаБазовая = СтрокаТЧ.Цена;
			СтрокаТЧ.Цена = СтрокаТЧ.Цена + СтрокаТЧ.Цена*СтрокаТЧ.ПроцентНаценки/100;
		КонецЕсли;
		
		СтрокаТЧ.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(СтрокаТЧ.Номенклатура);
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПеремещениеТоваров()

// Производит заполнение объекта на основании справочника "Контрагенты"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Контрагенты(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Заполняем специфические для данной операции реквизиты
	ХозОперация = Справочники.ХозОперации.УстановкаЦенКонтрагента;
	Документы.ИзменениеЦен.ХозОперацияПриИзменении(ЭтотОбъект, ДополнительныеСвойства.ПараметрыДействия);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Контрагенты()

// Производит заполнение объекта на основании документа "Согласование закупочных цен"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_СогласованиеЗакупочныхЦен(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	ДополнительныеСвойства.ПараметрыДействия.Вставить("НеПересчитыватьЦены", ИСТИНА);
	
	 //Вызываем общий обработчик заполнения
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	
	Если ПодразделениеКомпании.ПолучатьЗакупочныеЦеныИзПротоколов ИЛИ 1=1 Тогда //Всегда будем делать изменение цен компании //Закупочные уже установлены протоколом, будем работать по розничным
		
		ХозОперация           = Справочники.ХозОперации.УстановкаЦенКомпании;
		Контрагент            = Справочники.Контрагенты.ПустаяСсылка();
		ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		//ДатаНачалаДействия    = ДанныеЗаполнения.Дата;
		
		МоментЦены = ?(Ссылка.Пустая(), КонецДня(ТекущаяДата()), Ссылка.МоментВремени());
		
		БазовыйТипЦен = ДанныеЗаполнения.ТипЦен;
		Если НЕ ЗначениеЗаполнено(БазовыйТипЦен) Тогда
			БазовыйТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки", ЭтотОбъект);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(БазовыйТипЦен) Тогда
			БазовыйТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		КонецЕсли;
		
		ТипЦенНоменклатуры = ПодразделениеКомпании.ТипЦенРеализации;
		Если НЕ ЗначениеЗаполнено(ТипЦенНоменклатуры) Тогда
			ТипЦенНоменклатуры = ПравоПользователя("ОсновнойТипЦенПродажи", ЭтотОбъект);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТипЦенНоменклатуры) Тогда
			ТипЦенНоменклатуры = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
		КонецЕсли;
		
		ТоварыОснования = ДанныеЗаполнения.Товары.Выгрузить();
		
		ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		КурсДокумента   = ДанныеЗаполнения.КурсДокумента;
		
		НоваяСтрока = ПараметрыРасчета.Добавить();
		НоваяСтрока.ТипЦен               = ТипЦенНоменклатуры;
		НоваяСтрока.РасчетЦенОт          = 0;
		НоваяСтрока.ОкруглятьДо          = 0.01;
		Если ЗначениеЗаполнено(ТипЦенНоменклатуры.ВариантОкругления) ИЛИ ТипЦенНоменклатуры.ВариантыОкругления.Количество()>0 Тогда
			НоваяСтрока.ОкруглениеИзТипаЦены = Истина;
		КонецЕсли;
		Если НоваяСтрока.ТипЦен.Рассчитывается Тогда
			НоваяСтрока.ПроцентНаценки = НоваяСтрока.ТипЦен.ПроцентСкидкиНаценки;
		КонецЕсли;
		
		Для Каждого ТекущаяСтрока Из Товары Цикл
			ТекущаяСтрока.ТипЦен = ТипЦенНоменклатуры;
			ВалютаНоменклатуры = ?(ТекущаяСтрока.ТипЦен.ВВалютеУчета, ТекущаяСтрока.Номенклатура.ВалютаУчета, ТекущаяСтрока.ТипЦен.ВалютаЦены);
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаНоменклатуры, Дата);
			КурсВалюты     = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			
			СтрокаТоваровОснования = ТоварыОснования.Найти(ТекущаяСтрока.Номенклатура, "Номенклатура");
			Если СтрокаТоваровОснования = Неопределено Тогда
				ТекущаяСтрока.ЦенаБазовая = 0;
			Иначе
				ТекущаяСтрока.ЦенаБазовая = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(СтрокаТоваровОснования.Цена, ВалютаДокумента, КурсДокумента, ВалютаНоменклатуры, КурсВалюты);
			КонецЕсли;
			
			ТекущаяСтрока.Цена = ЦенообразованиеСервер.ПолучитьЦену(ТипЦенНоменклатуры, ТекущаяСтрока.Номенклатура, МоментЦены,, ВалютаНоменклатуры, КурсВалюты,, ТекущаяСтрока.ЕдиницаИзмерения, ПодразделениеКомпанииПолучатель);
			ТекущаяСтрока.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(ТекущаяСтрока.Номенклатура);
			ТекущаяСтрока.ПроцентНаценки=?(ТекущаяСтрока.ЦенаБазовая=0,0,((ТекущаяСтрока.Цена*100)/ТекущаяСтрока.ЦенаБазовая)-100);
		КонецЦикла;
		
	Иначе
		ХозОперация = Справочники.ХозОперации.УстановкаЦенКонтрагента;
		//ДатаНачалаДействия = ДанныеЗаполнения.Дата;
		
		ТипЦен = ДанныеЗаполнения.ТипЦен;
		БазовыйТипЦен=ДанныеЗаполнения.ТипЦен;
		
		НоваяСтрока = ПараметрыРасчета.Добавить();
		НоваяСтрока.ТипЦен = БазовыйТипЦен;
		
		Если НоваяСтрока.ТипЦен.Рассчитывается Тогда
			НоваяСтрока.ПроцентНаценки = НоваяСтрока.ТипЦен.ПроцентСкидкиНаценки;
		КонецЕсли;
		
		//Расчет цен от базового типа цен
		НоваяСтрока.РасчетЦенОт   = 0;
		НоваяСтрока.ОкруглятьДо = 0;
		
		Документы.ИзменениеЦен.ЗаполнитьБазовыеЦены(ЭтотОбъект);
		Для Каждого ТекущаяСтрока Из Товары Цикл
			ТекущаяСтрока.ТипЦен = ТипЦен;
			ТекущаяСтрока.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(ТекущаяСтрока.Номенклатура);
			Если ТекущаяСтрока.ЦенаБазовая>0 Тогда 
				ТекущаяСтрока.ПроцентНаценки=?(ТекущаяСтрока.ЦенаБазовая=0,0,((ТекущаяСтрока.Цена-ТекущаяСтрока.ЦенаБазовая)*100/ТекущаяСтрока.ЦенаБазовая));
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_СогласованиеЗакупочныхЦен()

// Производит заполнение объекта по передаваемой структуре
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_Структура(ДанныеЗаполнения, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	Если ДанныеЗаполнения.Свойство("ХозОперация") Тогда
		ХозОперация = ДанныеЗаполнения.ХозОперация;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("БазовыйТипЦен") Тогда
		БазовыйТипЦен = ДанныеЗаполнения.БазовыйТипЦен;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("СписокТиповЦен") И (ДанныеЗаполнения.Свойство("Номенклатура") ИЛИ ДанныеЗаполнения.Свойство("ПрайсЛистКонтрагента")) Тогда
		
		ПроцентНаценкиИзНоменклатуры = Ложь;
		РасчетЦенОт                  = 0;
		
		Если ДанныеЗаполнения.Свойство("ПараметрыРасчетаТиповЦен") Тогда
			ПроцентНаценкиИзНоменклатуры = ДанныеЗаполнения.ПараметрыРасчетаТиповЦен.ПроцентНаценкиИзНоменклатуры;
			РасчетЦенОт                  = ДанныеЗаполнения.ПараметрыРасчетаТиповЦен.РасчетЦенОт;
		КонецЕсли;
		
		Для Каждого ТекущийТипЦен Из ДанныеЗаполнения.СписокТиповЦен.ТекущийСписокТипЦен Цикл
			НоваяСтрока = ПараметрыРасчета.Добавить();
			НоваяСтрока.ТипЦен = ТекущийТипЦен.Значение;
			НоваяСтрока.ПроцентНаценкиИзНоменклатуры = ПроцентНаценкиИзНоменклатуры;
			НоваяСтрока.РасчетЦенОт = РасчетЦенОт;
		КонецЦикла;
		
		Если ДанныеЗаполнения.Свойство("Номенклатура") Тогда
			Номенклатура = ДанныеЗаполнения.Номенклатура;
			ОсновнаяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(Номенклатура);
			КоэффициентОсновнойЕдиницы = ОсновнаяЕдиницаИзмерения.Коэффициент;
			
			Для Каждого ТекущийТипЦен Из ДанныеЗаполнения.СписокТиповЦен.ТекущийСписокТипЦен Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.ТипЦен = ТекущийТипЦен.Значение;
				НоваяСтрока.ЕдиницаИзмерения = ОсновнаяЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = КоэффициентОсновнойЕдиницы;
				НоваяСтрока.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(НоваяСтрока.Номенклатура);
			КонецЦикла;
		ИначеЕсли ДанныеЗаполнения.Свойство("ПрайсЛистКонтрагента") Тогда
			// Получим номенклатуру по прайс-листу контрагента и заполним табличную часть "Товары".
			ТаблицаТоваров = Документы.ИзменениеЦен.ПолучениеНоменклатурыПоПрайсЛистуКонтрагента(ЭтотОбъект, ДанныеЗаполнения.ПрайсЛистКонтрагента, Истина);
			Если НЕ ТаблицаТоваров = Неопределено Тогда
				Для Каждого ТекущийТипЦен Из ДанныеЗаполнения.СписокТиповЦен.ТекущийСписокТипЦен Цикл
					Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
						Если НЕ ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
							Продолжить;
						КонецЕсли;
						НоваяСтрока = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
						Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока);
						НоваяСтрока.ТипЦен = ТекущийТипЦен.Значение;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Документы.ИзменениеЦен.ЗаполнитьБазовыеЦены(ЭтотОбъект);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_Структура()

// Производит заполнение объекта на основании документа "Прайс-листы контрагентов".
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения_ПрайсЛистыКонтрагентов(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	ДополнительныеСвойства.ПараметрыДействия.Вставить("НеПересчитыватьЦены", ИСТИНА);
	
	// Вызываем общий обработчик заполнения.
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, 
			СтандартнаяОбработка) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	БазовыйТипЦен = ДанныеЗаполнения.ТипЦен;
	Если НЕ ЗначениеЗаполнено(БазовыйТипЦен) Тогда
		БазовыйТипЦен = ПравоПользователя("ОсновнойТипЦенЗакупки", ЭтотОбъект);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(БазовыйТипЦен) Тогда
		БазовыйТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	КонецЕсли;
	
	НоваяСтрока = ПараметрыРасчета.Добавить();
	НоваяСтрока.ТипЦен = БазовыйТипЦен;
	//Расчет цен от базового типа цен
	НоваяСтрока.РасчетЦенОт = 4;
	НоваяСтрока.ОкруглятьДо = 0;
	Если НоваяСтрока.ТипЦен.Рассчитывается Тогда
		НоваяСтрока.ПроцентНаценки = НоваяСтрока.ТипЦен.ПроцентСкидкиНаценки;
	КонецЕсли;
	
	ТипЦенНоменклатуры = ПодразделениеКомпании.ТипЦенРеализации;
	Если НЕ ЗначениеЗаполнено(ТипЦенНоменклатуры) Тогда
		ТипЦенНоменклатуры = ПравоПользователя("ОсновнойТипЦенПродажи", ЭтотОбъект);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТипЦенНоменклатуры) Тогда
		ТипЦенНоменклатуры = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	КонецЕсли;
	
	ХозОперация           = Справочники.ХозОперации.УстановкаЦенКомпании;
	Контрагент            = Справочники.Контрагенты.ПустаяСсылка();
	ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	БазовыйТипЦен         = ДанныеЗаполнения.ТипЦен;
	//ДатаНачалаДействия    = Дата;
	ТипЦенНоменклатуры    = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	ВВалютеУчета          = ТипЦенНоменклатуры.ВВалютеУчета;
	ВалютаЦены            = ТипЦенНоменклатуры.ВалютаЦены;
	МоментЦены            = ?(Ссылка.Пустая(), КонецДня(ТекущаяДата()), Ссылка.МоментВремени());
	ПрайсЛистКонтрагента  = ДанныеЗаполнения;
	
	НоваяСтрока = ПараметрыРасчета.Добавить();
	НоваяСтрока.ТипЦен               = ТипЦенНоменклатуры;
	НоваяСтрока.РасчетЦенОт          = 4;
	НоваяСтрока.ОкруглятьДо          = 0.01;
	Если ЗначениеЗаполнено(ТипЦенНоменклатуры.ВариантОкругления) ИЛИ ТипЦенНоменклатуры.ВариантыОкругления.Количество()>0 Тогда
		НоваяСтрока.ОкруглениеИзТипаЦены = Истина;
	КонецЕсли;
	Если НоваяСтрока.ТипЦен.Рассчитывается Тогда
		НоваяСтрока.ПроцентНаценки = НоваяСтрока.ТипЦен.ПроцентСкидкиНаценки;
	КонецЕсли;
	
	ПараметрыДействия = Новый Структура;
	
	Товары.Очистить();
	
	// заполним ТЧ "Товары" по прайс-листу
	ТаблицаТоваров = Документы.ИзменениеЦен.ПолучениеНоменклатурыПоПрайсЛистуКонтрагента(ЭтотОбъект, ДанныеЗаполнения, Истина);
	
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеЗаполнения.Валюта, Дата);
	КурсПрайсЛиста = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.ТипЦен       = БазовыйТипЦен;
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока, ПараметрыДействия);
		
		НоваяСтрока.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(НоваяСтрока.Номенклатура);
		
		ВалютаНоменклатуры = ?(ВВалютеУчета, ТекущаяСтрока.ВалютаУчета, ВалютаЦены);
		СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаНоменклатуры, Дата);
		КурсВалютыНоменклатуры = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		НоваяСтрока.Цена = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекущаяСтрока.Цена, ДанныеЗаполнения.Валюта, КурсПрайсЛиста, ВалютаНоменклатуры, КурсВалютыНоменклатуры);
	КонецЦикла;
	
	Если НЕ ТипЦенНоменклатуры = БазовыйТипЦен Тогда
		Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ТипЦен       = ТипЦенНоменклатуры;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			Документы.ИзменениеЦен.ТоварыНоменклатураПриИзменении(ЭтотОбъект, НоваяСтрока, ПараметрыДействия);
			
			НоваяСтрока.БазоваяЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(НоваяСтрока.Номенклатура);
			
			ВалютаНоменклатуры = ?(ВВалютеУчета, ТекущаяСтрока.ВалютаУчета, ВалютаЦены);
			СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаНоменклатуры, Дата);
			КурсВалютыНоменклатуры = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			
			НоваяСтрока.ЦенаБазовая    = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекущаяСтрока.Цена, ДанныеЗаполнения.Валюта, КурсПрайсЛиста, ВалютаНоменклатуры, КурсВалютыНоменклатуры);
			НоваяСтрока.ПроцентНаценки = ТекущаяСтрока.ПроцентНаценки;
			НоваяСтрока.Цена           = Окр(?(НоваяСтрока.ПроцентНаценки = 0, 0, НоваяСтрока.ПроцентНаценки/100*НоваяСтрока.ЦенаБазовая)+НоваяСтрока.ЦенаБазовая, 2, РежимОкругления.Окр15как20);
			НоваяСтрока.СуммаНаценки   = НоваяСтрока.Цена-НоваяСтрока.ЦенаБазовая;
		КонецЦикла;
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события.
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаЗаполнения_ПрайсЛистыКонтрагентов()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ОБЪЕКТА

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ОбработкаЗаполнения_Структура(ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(ПодразделениеКомпанииПолучатель) Тогда //skud будем устанавливать цены без подразделений
	//	ПодразделениеКомпанииПолучатель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	//КонецЕсли; 
	
	//Если Не ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
	//	ДатаНачалаДействия = Дата;
	//КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Установим параметры проверки документа
	ДополнительныеСвойства.Вставить("КонтрольЗаполненияХарактеристик",        Ложь);
	ДополнительныеСвойства.Вставить("КонтрольОперацииНаСоответствиеДоговору", Ложь);
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыРасчета.Количество() = 0 Тогда
		
		ВывестиСообщение(НСтр("ru = 'Не выбраны типы цен для данного документа.'"),ЭтотОбъект,,,Отказ);
		
	КонецЕсли;
	
	Если ХозОперация=Справочники.ХозОперации.УстановкаЦенКомпанииГрупповая И ТипыЦенГрупповойУстановки.Количество()=0 Тогда
		
		ВывестиСообщение(НСтр("ru = 'Не указаны типы цен для групповой установки.'"),ЭтотОбъект,,,Отказ);
		
	КонецЕсли;
	
	ИмеютсяНеРасчетныеТипыЦен = Ложь;
	Для Каждого ТекущаяСтрока Из ПараметрыРасчета Цикл
		Если НЕ ТекущаяСтрока.ТипЦен.Рассчитывается Тогда
			ИмеютсяНеРасчетныеТипыЦен = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Товары.Количество() = 0 И ИмеютсяНеРасчетныеТипыЦен Тогда
		ВывестиСообщение(НСтр("ru = 'Не была добавлена номенклатура.'"),ЭтотОбъект,,,Отказ);
	КонецЕсли;
	
	КонтрольМинимальнойНаценки = ПравоПользователя("КонтрольМинимальнойНаценки", ЭтотОбъект);
	Если КонтрольМинимальнойНаценки<>Перечисления.ВидыКонтроля.НеКонтролировать И ХозОперация <> Справочники.ХозОперации.УстановкаЦенКонтрагента Тогда
		МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
		МассивТиповЦен = Новый Массив;
		ЭтоУстановкаЦенКомпании = ХозОперация = Справочники.ХозОперации.УстановкаЦенКомпании;
		ЭтоУстановкаЦенКомпанииГрупповая = ХозОперация = Справочники.ХозОперации.УстановкаЦенКомпанииГрупповая;
		
		Если ЭтоУстановкаЦенКомпании Тогда
			МассивТиповЦен = Товары.ВыгрузитьКолонку("ТипЦен");
		ИначеЕсли ЭтоУстановкаЦенКомпанииГрупповая Тогда
			МассивТиповЦен = ТипыЦенГрупповойУстановки.ВыгрузитьКолонку("ТипЦен");
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	СогласованныеЦены.Номенклатура КАК Номенклатура,
		                      |	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
		                      |	СогласованныеЦены.Контрагент КАК Контрагент,
		                      |	СогласованныеЦены.Приоритет КАК Приоритет,
		                      |	СогласованныеЦены.Период КАК ДатаНачалаДействия,
		                      |	СогласованныеЦены.СрокДействия КАК СрокДействия,
		                      |	СогласованныеЦены.Регистратор КАК Регистратор,
		                      |	СогласованныеЦены.Регистратор.Дата КАК РегистраторДата,
		                      |	СогласованныеЦены.Цена КАК СогласованнаяЦена,
		                      |	ПодразделенияКомпании.ТипЦенРеализации КАК ТипЦенРеализации
		                      |ПОМЕСТИТЬ ТаблицаСогласованныеЦены
		                      |ИЗ
		                      |	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		                      |		ПО СогласованныеЦены.ГруппаПоставки = ПодразделенияКомпании.ГруппаПоставки
		                      |ГДЕ
		                      |	СогласованныеЦены.СрокДействия >= &ДатаПроверки
		                      |	И СогласованныеЦены.Период <= &ДатаПроверки
		                      |	И СогласованныеЦены.Номенклатура В(&МассивНоменклатуры)
		                      |	И ПодразделенияКомпании.ТипЦенРеализации В(&МассивТиповЦен)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	СогласованныеЦены.Номенклатура КАК Номенклатура,
		                      |	МАКСИМУМ(СогласованныеЦены.СогласованнаяЦена) КАК Цена,
		                      |	СогласованныеЦены.ТипЦенРеализации КАК ТипЦенРеализации
		                      |ИЗ
		                      |	ТаблицаСогласованныеЦены КАК СогласованныеЦены
		                      |ГДЕ
		                      |	СогласованныеЦены.Регистратор В
		                      |			(ВЫБРАТЬ ПЕРВЫЕ 1
		                      |				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
		                      |			ИЗ
		                      |				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
		                      |			ГДЕ
		                      |				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
		                      |				И ТаблицаСогласованныеЦены.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки
		                      |			УПОРЯДОЧИТЬ ПО
		                      |				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
		                      |				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
		                      |				ТаблицаСогласованныеЦены.РегистраторДата УБЫВ,
		                      |				ТаблицаСогласованныеЦены.СрокДействия)
		                      |	И СогласованныеЦены.СогласованнаяЦена <> 0
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	СогласованныеЦены.Номенклатура,
		                      |	СогласованныеЦены.ТипЦенРеализации");
		Запрос.УстановитьПараметр("ДатаПроверки",Дата);
		Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
		Запрос.УстановитьПараметр("МассивТиповЦен",МассивТиповЦен);
		
		ТаблицаЗакупочныхЦен = Запрос.Выполнить().Выгрузить();
		
		Для каждого ТекСтрокаТЧ Из Товары Цикл
			Если ЭтоУстановкаЦенКомпании Тогда
				// проверка типов цен из таблицы товаров
				ЗакупочнаяЦена = 0;
				СтрокиЗакупочнойЦены = ТаблицаЗакупочныхЦен.НайтиСтроки(Новый Структура("Номенклатура,ТипЦенРеализации",ТекСтрокаТЧ.Номенклатура,ТекСтрокаТЧ.ТипЦен));
				Если СтрокиЗакупочнойЦены.Количество()>0 Тогда
					ЗакупочнаяЦена = СтрокиЗакупочнойЦены[0].Цена;
				КонецЕсли;
				Если ЗакупочнаяЦена=0 Тогда
					Продолжить;
				КонецЕсли;
				МинимальнаяНаценка = ЦенообразованиеСервер.ПолучитьМинимальнуюНаценку(ТекСтрокаТЧ.Номенклатура,Дата,ТекСтрокаТЧ.ТипЦен);
				Если МинимальнаяНаценка=0 Тогда
					Продолжить;
				КонецЕсли;
				РеальнаяНаценка =  Окр((ТекСтрокаТЧ.Цена - ЗакупочнаяЦена)/ЗакупочнаяЦена*100,2);
				
				Если РеальнаяНаценка<МинимальнаяНаценка Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Строка №%1 - установлена наценка %2, закупочная цена %3, минимальная наценка %4.'"),ТекСтрокаТЧ.НомерСтроки,""+РеальнаяНаценка+"%",Формат(ЗакупочнаяЦена,"ЧДЦ=2"),""+МинимальнаяНаценка+"%");
					ВывестиСообщение(ТекстСообщения,ЭтотОбъект,,ТекСтрокаТЧ.НомерСтроки);
					Если КонтрольМинимальнойНаценки=Перечисления.ВидыКонтроля.Запрещать Тогда
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ЭтоУстановкаЦенКомпанииГрупповая Тогда
				// проерка типов цен из таблицы типов цен
				Для каждого СтрокаТипаЦен из ТипыЦенГрупповойУстановки Цикл
					ЗакупочнаяЦена = 0;
					СтрокиЗакупочнойЦены = ТаблицаЗакупочныхЦен.НайтиСтроки(Новый Структура("Номенклатура,ТипЦенРеализации",ТекСтрокаТЧ.Номенклатура,СтрокаТипаЦен.ТипЦен));
					Если СтрокиЗакупочнойЦены.Количество()>0 Тогда
						ЗакупочнаяЦена = СтрокиЗакупочнойЦены[0].Цена;
					КонецЕсли;
					Если ЗакупочнаяЦена=0 Тогда
						Продолжить;
					КонецЕсли;
					МинимальнаяНаценка = ЦенообразованиеСервер.ПолучитьМинимальнуюНаценку(ТекСтрокаТЧ.Номенклатура,Дата,СтрокаТипаЦен.ТипЦен);
					Если МинимальнаяНаценка=0 Тогда
						Продолжить;
					КонецЕсли;
					РеальнаяНаценка =  Окр((ТекСтрокаТЧ.Цена - ЗакупочнаяЦена)/ЗакупочнаяЦена*100,2);
					
					Если РеальнаяНаценка<МинимальнаяНаценка Тогда
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Строка №%1 - установлена наценка %2, закупочная цена %3, минимальная наценка %4.'"),ТекСтрокаТЧ.НомерСтроки,""+РеальнаяНаценка+"%",Формат(ЗакупочнаяЦена,"ЧДЦ=2"),""+МинимальнаяНаценка+"%");
						ВывестиСообщение(ТекстСообщения,ЭтотОбъект,,ТекСтрокаТЧ.НомерСтроки);
						Если КонтрольМинимальнойНаценки=Перечисления.ВидыКонтроля.Запрещать Тогда
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого ТекСтрокаТЧ Из Товары Цикл
		
		ТекТипНоменклатуры = ТекСтрокаТЧ.Номенклатура.ТипНоменклатуры;
		Если ТекСтрокаТЧ.ТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения И ТекСтрокаТЧ.ЕдиницаИзмерения.Пустая() И ТекТипНоменклатуры.УчетЦенТолькоВРазрезеДопПараметров Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Строка №%1 - не выбрана единица измерения номенклатуры.'"),ТекСтрокаТЧ.НомерСтроки);
			ВывестиСообщение(ТекстСообщения,ЭтотОбъект,,ТекСтрокаТЧ.НомерСтроки,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	// Очистим неиспользуемые реквизиты
	Если ХозОперация <> Справочники.ХозОперации.УстановкаЦенКонтрагента Тогда
		Контрагент            = Справочники.Контрагенты.ПустаяСсылка();
		ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	ЗаполнитьСкладКомпании = Ложь;
	Для Каждого ТекущаяСтрока Из ПараметрыРасчета Цикл
		Если ТекущаяСтрока.РасчетЦенОт = 3 ИЛИ ТекущаяСтрока.РасчетЦенОт = 5 Тогда
			ЗаполнитьСкладКомпании = Истина;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗаполнитьСкладКомпании Тогда
		СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ХозОперация = Справочники.ХозОперации.УстановкаЦенКомпании Тогда
		Если НЕ Контрагент.Пустая() Тогда
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Если НЕ ДоговорВзаиморасчетов.Пустая() Тогда
			ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли; 
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	ВыполнитьПроверкуМРЦ(Отказ);		
	//Мальцев А.Ю. ---	
	
	Если ХозОперация=Справочники.ХозОперации.УстановкаЦенКомпанииГрупповая Тогда
		МассивТиповЦен = ТипыЦенГрупповойУстановки.ВыгрузитьКолонку("ТипЦен");
	Иначе
		МассивТиповЦен = ПараметрыРасчета.ВыгрузитьКолонку("ТипЦен");
	КонецЕсли;
	
	// Если надо переоценим все склады.
	Если ПодразделениеКомпанииПолучатель.ПереоценкаРозницаПоПриходу Тогда
		// Склады
		ЗапросСклады=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СкладыКомпании.Ссылка КАК СкладКомпании
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.Розничный
		|	И СкладыКомпании.ТипЦенРозничнойТорговли В (&ТипЦен)
		|	И СкладыКомпании.ПодразделениеКомпании = &Подразделение");
		//ЗапросСклады.УстановитьПараметр("ТипЦен",ПараметрыРасчета.ВыгрузитьКолонку("ТипЦен"));
		ЗапросСклады.УстановитьПараметр("ТипЦен", МассивТиповЦен);
		ЗапросСклады.УстановитьПараметр("Подразделение",ПодразделениеКомпанииПолучатель);
		
		ВыборкаСклады = ЗапросСклады.Выполнить().Выбрать();
		// Товары
		ЗапросТовары=Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументТовары.Номенклатура КАК Номенклатура,
		|	&ПустаяХарактеристика КАК ХарактеристикаНоменклатуры,
		|	0 КАК Количество,
		|	ДокументТовары.Цена КАК ЦенаРозничная,
		|	0 КАК Резерв
		|ИЗ
		|	Документ.ИзменениеЦен.Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка=&Ссылка
		|");
		ЗапросТовары.УстановитьПараметр("Ссылка",Ссылка);
		ЗапросТовары.УстановитьПараметр("ПустаяХарактеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		РезультатЗапросаПоТоварам=ЗапросТовары.Выполнить();
		// Переоцениваем
		НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
		Пока ВыборкаСклады.Следующий() Цикл
			НаборЗаписейОстатки.РежимПроведения=РежимПроведения;
			НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейОстатки.РезультатЗапросаПоТоварам=РезультатЗапросаПоТоварам;
			НаборЗаписейОстатки.СкладКомпании=ВыборкаСклады.СкладКомпании;
			Отказ=НЕ НаборЗаписейОстатки.Переоценка(ХозОперация,Истина,Истина) ИЛИ Отказ;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// Устанавливаем цены
		//Для Каждого ТекущаяСтрока Из ПараметрыРасчета Цикл
		Для Каждого ТекТипЦен Из МассивТиповЦен Цикл
			//Если ТекущаяСтрока.ТипЦен.Рассчитывается Тогда
			Если ТекТипЦен.Рассчитывается Тогда
				Продолжить;
			КонецЕсли;
			НаборЗаписейЦены = Движения.Цены;
			НаборЗаписейЦены.ДокументОбъект         = ЭтотОбъект;
			НаборЗаписейЦены.Контрагент             = ?(ХозОперация = Справочники.ХозОперации.УстановкаЦенКонтрагента, Контрагент, Справочники.Контрагенты.ПустаяСсылка());
			НаборЗаписейЦены.ДоговорВзаиморасчетов  = ?(ХозОперация = Справочники.ХозОперации.УстановкаЦенКонтрагента, ДоговорВзаиморасчетов, Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка());
			НаборЗаписейЦены.ТипЦен                 = ТекТипЦен;//ТекущаяСтрока.ТипЦен;
			НаборЗаписейЦены.ПодразделениеКомпании  = ПодразделениеКомпанииПолучатель;
			НаборЗаписейЦены.ИмяРеквизитаЦена       = "Цена";
			НаборЗаписейЦены.УстанавливатьЦеныУслуг = Истина;
			НаборЗаписейЦены.ДатаНачалаДействия     = ДатаНачалаДействия;
			НаборЗаписейЦены.МожноСделатьОтменуЦены = Истина;
			НаборЗаписейЦены.ТипЦенВТабличнойЧасти  = ?(ХозОперация = Справочники.ХозОперации.УстановкаЦенКомпанииГрупповая, Ложь, Истина);
			Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

//Мальцев А.Ю. +++
Процедура ВыполнитьПроверкуМРЦ(Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеЦенТовары.Цена КАК Цена,
	|	ИзменениеЦенТовары.Номенклатура КАК Номенклатура,
	|	ИзменениеЦенТовары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втДанныеДокумента
	|ИЗ
	|	Документ.ИзменениеЦен.Товары КАК ИзменениеЦенТовары
	|ГДЕ
	|	ИзменениеЦенТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель КАК ГруппаГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итНомерГруппыГАК КАК НомерГруппыГАК,
	|	Номенклатура.ВидАлкогольнойПродукции.Родитель.итУдельныйОбъем КАК УдельныйОбъем,
	|	Номенклатура.Крепость КАК Крепость,
	|	Номенклатура.Объем КАК Объем,
	|	Номенклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				втДанныеДокумента.Номенклатура КАК Номенклатура
	|			ИЗ
	|				втДанныеДокумента КАК втДанныеДокумента)
	|	И Номенклатура.ВидАлкогольнойПродукции <> ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итУдельныеРозничныеЦеныСрезПоследних.Группа КАК Группа,
	|	итУдельныеРозничныеЦеныСрезПоследних.Крепость КАК Крепость,
	|	итУдельныеРозничныеЦеныСрезПоследних.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втУдельныеЦены
	|ИЗ
	|	РегистрСведений.итУдельныеРозничныеЦены.СрезПоследних(&Период, ) КАК итУдельныеРозничныеЦеныСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.Ссылка КАК Группа,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МинимальныйОбъем КАК МинимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.МаксимальныйОбъем КАК МаксимальныйОбъем,
	|	ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф.ОбъемИскл КАК ОбъемИскл
	|ПОМЕСТИТЬ втИключенияОбъемныхКоэфф
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции.итИсключенияОбъемныхКоэфф КАК ВидыАлкогольнойПродукцииитИсключенияОбъемныхКоэфф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНоменклатура.Номенклатура КАК Номенклатура,
	|	втНоменклатура.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втНоменклатура.ГруппаГАК КАК ГруппаГАК,
	|	втНоменклатура.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втНоменклатура.УдельныйОбъем КАК УдельныйОбъем,
	|	втНоменклатура.Крепость КАК Крепость,
	|	втНоменклатура.Объем КАК Объем,
	|	ЕСТЬNULL(втУдельныеЦены.УдельнаяЦена, 0) КАК УдельнаяЦена,
	|	ЕСТЬNULL(втИключенияОбъемныхКоэфф.ОбъемИскл, 0) КАК ОбъемИскл,
	|	втНоменклатура.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втСгруппированнаяТаблица
	|ИЗ
	|	втНоменклатура КАК втНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУдельныеЦены КАК втУдельныеЦены
	|		ПО втНоменклатура.ГруппаГАК = втУдельныеЦены.Группа
	|			И втНоменклатура.Крепость = втУдельныеЦены.Крепость
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИключенияОбъемныхКоэфф КАК втИключенияОбъемныхКоэфф
	|		ПО втНоменклатура.Объем > втИключенияОбъемныхКоэфф.МинимальныйОбъем
	|			И втНоменклатура.Объем <= втИключенияОбъемныхКоэфф.МаксимальныйОбъем
	|			И втНоменклатура.ГруппаГАК <= втИключенияОбъемныхКоэфф.Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСгруппированнаяТаблица.Номенклатура КАК Номенклатура,
	|	втСгруппированнаяТаблица.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втСгруппированнаяТаблица.ГруппаГАК КАК ГруппаГАК,
	|	втСгруппированнаяТаблица.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втСгруппированнаяТаблица.УдельныйОбъем КАК УдельныйОбъем,
	|	втСгруппированнаяТаблица.Крепость КАК Крепость,
	|	втСгруппированнаяТаблица.Объем КАК Объем,
	|	втСгруппированнаяТаблица.УдельнаяЦена КАК УдельнаяЦена,
	|	втСгруппированнаяТаблица.ОбъемИскл КАК ОбъемИскл,
	|	ВЫБОР
	|		КОГДА втСгруппированнаяТаблица.УдельныйОбъем = 0
	|			ТОГДА 0
	|		КОГДА втСгруппированнаяТаблица.ОбъемИскл > 0
	|			ТОГДА втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.ОбъемИскл / втСгруппированнаяТаблица.УдельныйОбъем
	|		ИНАЧЕ втСгруппированнаяТаблица.УдельнаяЦена * втСгруппированнаяТаблица.Объем / втСгруппированнаяТаблица.УдельныйОбъем
	|	КОНЕЦ КАК МРЦ,
	|	втСгруппированнаяТаблица.ЕРПМастерКлюч КАК ЕРПМастерКлюч
	|ПОМЕСТИТЬ втИтоговая
	|ИЗ
	|	втСгруппированнаяТаблица КАК втСгруппированнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИтоговая.Номенклатура КАК Номенклатура,
	|	втИтоговая.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
	|	втИтоговая.ГруппаГАК КАК ГруппаГАК,
	|	втИтоговая.НомерГруппыГАК КАК НомерГруппыГАК,
	|	втИтоговая.УдельныйОбъем КАК УдельныйОбъем,
	|	втИтоговая.Крепость КАК Крепость,
	|	втИтоговая.Объем КАК Объем,
	|	втИтоговая.УдельнаяЦена КАК УдельнаяЦена,
	|	втИтоговая.ОбъемИскл КАК ОбъемИскл,
	|	втИтоговая.МРЦ КАК МРЦ,
	|	втИтоговая.ЕРПМастерКлюч КАК ЕРПМастерКлюч,
	|	втДанныеДокумента.Номенклатура КАК НоменклатураДокумента,
	|	втДанныеДокумента.Цена КАК Цена,
	|	втДанныеДокумента.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	втДанныеДокумента КАК втДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИтоговая КАК втИтоговая
	|		ПО втДанныеДокумента.Номенклатура = втИтоговая.Номенклатура
	|			И (втИтоговая.МРЦ > 0)
	|			И втДанныеДокумента.Цена < втИтоговая.МРЦ
	|ГДЕ
	|	НЕ втИтоговая.Номенклатура ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + Строка(ВыборкаДетальныеЗаписи.НомерСтроки) + ", позиция " + Строка(ВыборкаДетальныеЗаписи.Номенклатура) + 
														  ". Цена меньше минимальной розничной цены " + Строка(ВыборкаДетальныеЗаписи.МРЦ) + ". Проведение не выполнено.");
	КонецЦикла;
	
	Если Отказ Тогда	
		ЗаписьЖурналаРегистрации("Проверка МРЦ", УровеньЖурналаРегистрации.Ошибка,,Ссылка,"Ошибка при проверке МРЦ");
	КонецЕсли;
	
КонецПроцедуры
//Мальцев А.Ю. ---	

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

#КонецЕсли
